import { InlineMath } from "react-katex";
import polygon from "../assets/themata/iounios2023/polygon.png"
import scanlines from "../assets/themata/iounios2023/scanlines.png"
import filled from "../assets/themata/iounios2023/filled.png"
import aliasing from "../assets/themata/iounios2023/aliasing.png"
import masks from "../assets/themata/iounios2023/masks.png"
import xyz from "../assets/themata/iounios2023/xyz.png"

import MatrixMath from "../components/Matrix";
export default function Iounios2023()
{
    return <div className="flex flex-col gap-3">
        <h1>Θέματα Ιούνιος 2023</h1>
        <a target="_blank" href="https://drive.google.com/drive/folders/1TGVor_8Q9auuIwQTogl-0LZkybX_p1_1?usp=drive_link">Θέματα</a>
        <h2>Θέμα 1. Σχεδίαση Ταύτιση</h2>
        <h3>1α</h3>
        <p>Δίνεται ο αλγοριθμος σχεδίασης γενικού πολυγώνου. Τα βήματα είναι τα εξής:</p>
        <ol className="list-decimal ml-5">
            <li>
                Υπολόγισε τις τομές <InlineMath math="I(x,y)"/> κάθε ακμής με όλες τος γραμμές σάρωσης και αποθήκευσε τις σε μια λίστα
            </li>
            <li>
                Ταξινόμησε τις τομές με βάση τα <InlineMath math="(y,x)"/>
            </li>
            <li>
                Εξαγωγή ζευγών απο τη λίστα & γέμισμα των εικονοστοιχείων μεταξύ τους
            </li>
        </ol>
        <p>Εφαρμόστε τον σχηματικά σε πολύγωνο της επιλογής σας, δείχνοντας τα βήματα για τουλάχιστον 3 γραμμές σάρωση απο τις οποίες τουλάχιστον μία τέμνει τ ην περίμετρο του πολυγώνου περισσότερες απο 2 φορές</p>
        <p>Το πολύγωνο που θα επιλέξω είναι αυτό εδώ</p>
        <img src={polygon} width={600} height={300} alt="polygon" />
        <p>Οι 3 γραμμές σάρωσης που θα επιλέξουμε είναι οι y=2,y=3 και y=5</p>
        <img src={scanlines} width={600} height={300} alt="scanlines" />
        <p>Για την γραμμή y=2 οι τομές είναι <InlineMath math="U=(1,2),T=(7,2)"/></p>
        <p>Για την γραμμή y=3 οι τομές είναι <InlineMath math="R=(1,3), S=(7,3)"/></p>
        <p>Για την γραμμή y=5 οι τομές είναι <InlineMath math="N=(1,5),O=(2,5),P=(3.7,5),Q=(6.3,5)"/></p>
        <p>Τα βάζουμε όλα σε μια λίστα, αρχικά με τυχαία σειρά</p>
        <p><InlineMath math="points= [R,S,U,T,N,O,P,Q]"/></p>
        <p>Έπειτα τα ταξινομούμε ως προς το y σε αύξουσα σειρά. Σε περίπτωση που έχουν ίδιο y τα ταξινομούμε ως προς x. Πάλι σε αύξουσα σειρά. Άρα η λίστα γίνεται.</p>
        <p><InlineMath math="points = [U,T,R,S,N,O,P,Q]"/></p>
        <p>Βγάζουμε τα σημεία ως ζεύγη απο τη λίστα και ζωγραφίζουμε τα pixels ανάμεσα τους</p>
        <p><InlineMath math="\{U,T\}, \{R,S\}, \{N,O\},\{P,O\}"/></p>
        <img src={filled} width={600} height={300} alt="filled" />
        <h3>1β</h3>
        <p>Η σχεδιάση με το παραπάνω αλγόριθμο, ενδέχεται να δημιουργήσει φαινόμετα ταύτισης</p>
        <h4>ι</h4>
        <p>Δείξτε σχηματικά πως θα εμφανιζόταν τέτοια φαινόμενα σε σχέση με τον αλγόριθμος της 1α</p>
        <img src={aliasing} width={600} height={300} alt="aliasing" />
        <h4>ιι</h4>
        <p>Περιγράψτες πως λειτουργεί ο αλγόριθμος αντιταύτισης Α-buffer</p>
        <p>Χρησιμοποιούμε μάσκες και λογικούς τελεστές για προσέγγιση κάλυψης</p>
        <p>Φτιάχνουμε μια μάσκα για κάθε ακμή. Στο τέλος συνδιάζουμε τις μάσκες με τον λογικο τελεστή XOR και προκύπτει μια μάσκα του πολυγώνου</p>
        <img src={masks} width={700} height={300} alt="masks" />
        <h2>Θέμα 2. Μετασχηματισμοί</h2>
        <h3>2a</h3>
        <p>Ποιο απο τα παρακάτω ισχύει για έναν ομογενή μετασχηματισμό συντεταγμένων. Εξηγήστε συνοπτικά.</p>
        <ul className="list-decimal ml-5">
            <li>
                Ενας συσχετισμενος μετασχηματισμος είναι και ομογενής
            </li>
            <li>
                <span className="text-green-600">Η εφαρμογή του διατηρεί τους λόγους των μηκών ενός σχήματος</span>
            </li>
            <li>
                Διατηρεί την τιμή της ομογενούς συντεταγμένης ενός σημείου
            </li>
        </ul>
        <p>Το 2 προκύπτει απο τον ορισμό ενός ομογενούς μετασχηματισμού</p>
        <h3>2β</h3>
        <p>Υπολογίστε τους μετασχηματισμούς που απαιτούνται για την μετατροπή αντικειμένου Κ</p>
        <p>
            <InlineMath math="K=[V1,V2,V3,V4,V5]="/> 
            <MatrixMath matrix={[
                [-1, 1, -1, 1, 0],
                [-1, -1, 1, 1, 0],
                [0, 0, 0, 0, 4],
                [1, 1, 1, 1, 1]
            ]}/>
        </p>
        <p>σε:</p>
        <p>
            <InlineMath math="K_1="/>
            <MatrixMath matrix={[
                [1, -1, 1, -1, 0],
                [-1,-1, 1, 1, 0],
                [0, 0, 0, 0, 4],
                [1, 1, 1, 1, 1]
            ]}/>
        </p>
        <p>εδω παρατηρούμε ότι</p>
        <img src={xyz} width={400} height={300} alt="masks" />
        <p>Βλέπουμε ότι το <InlineMath math="K_1"/> είναι περίπου ίδια τα σημεία. Με εξαίρεση τη συντεταγμένη x των σημειών όπου έχει το αντίθετο πρόσημο. Αυτό μπορούμε να το επιτύχουμε με μια αλλαγή κλίμακας στον άξονα x</p>
        <p>
            Αρα θα πολλαπλασιάσουμε με τον πίνακα
            <InlineMath math="\ S(-1,1,1)="/>
            <MatrixMath matrix={[
                [-1,0,0,0],
                [0, 1, 0,0],
                [0,0,1,0],
                [0,0,0,1]
            ]}/>
        </p>
        <p>Άρα</p>
        <p><InlineMath math="S(-1,1,1) \cdot K=K_1"/></p>
        <p>
            <MatrixMath matrix={[
                [-1,0,0,0],
                [0,1,0,0],
                [0,0,1,0],
                [0,0,0,1]
            ]}/>
            <MatrixMath matrix={[
                [-1,1,-1,1,0],
                [-1,-1,1,1,0],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
            <InlineMath math="="/>
            <MatrixMath matrix={[
                [1,-1,1,-1,0],
                [-1,-1,1,1,0],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
        </p>
        <p>Επόμενη μετατροπή απο <InlineMath math="K"/> σε <InlineMath math="K_2"/></p>
        <p>
            <InlineMath math="K_2="/>
            <MatrixMath matrix={[
                [-1,-1,1,1,0],
                [1,-1,1,-1,0],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
        </p>
        <p>Εδώ παρατηρούμε οτι έχουμε μια αλλαγή στους x και y άξονες. Καθώς δεν φένεται να είναι ούτε μεταφορά ούτε αλλαγή κλίμακας. Προκύπτει ότι είναι περιστροφή γύρω απο τον άξονα Z. Και είναι περιστροφή κατα -90 μοίρες ή -<InlineMath math="\frac{π}{2}"/></p>
        <p>
            <InlineMath math="R_z(-\frac{π}{2})="/>
            <MatrixMath matrix={[
                ["cos(-\\frac{π}{2})", "-sin(-\\frac{π}{2})", 0, 0],
                ["sin(-\\frac{π}{2})", "cos(-\\frac{π}{2})",0,0],
                [0,0,1,0],
                [0,0,0,1],
            ]}/>
            <InlineMath math="="/>
            <MatrixMath matrix={[
                [0,1,0,0],
                [-1,0,0,0],
                [0,0,1,0],
                [0,0,0,1]
            ]}/>
        </p>
        <p>Αρα</p>
        <p>
            <MatrixMath matrix={[
                [0,1,0,0],
                [-1,0,0,0],
                [0,0,1,0],
                [0,0,0,1]
            ]}/>
            <MatrixMath matrix={[
                [-1, 1, -1, 1, 0],
                [-1, -1, 1, 1, 0],
                [0, 0, 0, 0, 4],
                [1, 1, 1, 1, 1]
            ]}/>
            <InlineMath math="=K_2="/>
            <MatrixMath matrix={[
                [-1,-1,1,1,0],
                [1,-1,1,-1,0],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
        </p>
        <p>Τελική μετατροπή απο <InlineMath math="K"/> σε <InlineMath math="K_3"/></p>
        <p>
            <InlineMath math="K_3="/>
            <MatrixMath matrix={[
                [1,-1,1,-1,4],
                [-1,-1,1,1,4],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
        </p>
        <p>Εδώ παρατηρούμε οτι πάλι έχουν αλλάξει πρόσημο τα x. Οποτε θα πολλαπλασιάσουμε αρχικά πάλι με το <InlineMath math="S(-1,1,1)"/></p>
        <p>
            <MatrixMath matrix={[
                [-1,0,0,0],
                [0,1,0,0],
                [0,0,1,0],
                [0,0,0,1]
            ]}/>
            <MatrixMath matrix={[
                [-1,1,-1,1,0],
                [-1,-1,1,1,0],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
            <InlineMath math="="/>
            <MatrixMath matrix={[
                [1,-1,1,-1,0],
                [-1,-1,1,1,0],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
        </p>
        <p>Τώρα βλέπουμε οτι έχει προσθεθεί στους άξονες x και y ολων των σημειων ο άξονας z. Αυτό το πετυχαίνουμε με μια στρέβλωση ως προς τον άξονα z.</p>
        <p>
            <InlineMath math="Sh_z(1,1)="/>
            <MatrixMath matrix={[
                [1,0,1,0],
                [0,1,1,0],
                [0,0,1,0],
                [0,0,0,1]
            ]}/>
        </p>
        <p>Αρα αμα το χρησιμοποιήσουμε στον προηγούμενο πίνακα</p>
        <p>
            <MatrixMath matrix={[
                [1,0,1,0],
                [0,1,1,0],
                [0,0,1,0],
                [0,0,0,1]
            ]}/>
            <MatrixMath matrix={[
                [1,-1,1,-1,0],
                [-1,-1,1,1,0],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
            <InlineMath math="="/>
            <MatrixMath matrix={[
                [1,-1,1,-1,4],
                [-1,-1,1,1,4],
                [0,0,0,0,4],
                [1,1,1,1,1]
            ]}/>
            <InlineMath math="=K_3"/>
        </p>
        <h2>Θέμα 3. Παραμετρικές Καμπύλες</h2>
        <p>Δίνεται καμπύλη Bezier με σημεία ελέγχου:</p>
    </div>
}