import { InlineMath } from "react-katex";
import MatrixMath from "../components/Matrix";

export default function Septembrios2021()
{
    return <div className="flex flex-col gap-3">
        <h1>Θέματα Σεπτέμβριος 2021</h1>
        <a target="_blank" href="https://drive.google.com/drive/folders/1kipzqEnBrJ7MgK5GbZYzYOqhW63k-sV_?usp=sharing">Θέματα</a>
        <h2>Θέμα 1. Μετασχηματισμοί</h2>
        <p>Έστω κύβος με κορυφές (στήλες)</p>
        <p>
            <InlineMath math="C="/>
            <MatrixMath matrix={[
                [0,"M",0,"M",0,"M",0,"M"],
                [0,0,"M","M",0,0,"M","M"],
                [0,0,0,0,"M","M","M","M"],
                [1,1,1,1,1,1,1,1]
            ]}/>
        </p>
        <p>Οι κορυφές είναι στο Σύστημα Συντεταγμένων Μοντέλου (ΣΣΜ). Θέλουμε να τις μεταφέρουμε στο Σύστημα Συντεταγμένων Κόσμου (ΣΣΚ) ώστε να πάρει την εξής μορφή:</p>
        <ul className="list-disc ml-5">
            <li>
                το κέντρο του να βρεθεί στο σημείο <InlineMath math="[M,M,M,1]^T"/>
            </li>
            <li>
                να αποκτήσει διάσταση πλευράς ίση με 2 μονάδες
            </li>
            <li>
                να περιστραφεί κατα +45 μοίρες γύρω απο τον άξονα που περνά απο το κέντρο του και είναι παράλληλος με τον άξονα Ζ του ΣΣΚ
            </li>
        </ul>
        <h3>1.1</h3>
        <p>Αντικαταστήστε M με τελευταίο αριθμού του ΑΜ σας (έστω M=1). Υπολογίστε τον πίνακα μετασχηματισμού μοντέλου απο ΣΣΜ σε ΣΣΚ</p>
        <p>Ο πίνακας θα γίνει</p>
        <p>
            <InlineMath math="C="/>
            <MatrixMath matrix={[
                [0,1,0,1,0,1,0,1],
                [0,0,1,1,0,0,1,1],
                [0,0,0,0,1,1,1,1],
                [1,1,1,1,1,1,1,1]
            ]}/>
        </p>
        <p>Θέλουμε να κάνουμε περιστροφή και αλλαγή κλίμακας. Οι πίνακες που ξέρουμε έχουν ως προυπόθεση ότι το κέντρο του αντικειμένου είναι το (0,0,0). Οπότε πρίν κάνουμε κάποια περιστροφή ή αλλαγή κλίμακας θα το μετακινήσουμε εκεί.
            Το κέντρο του αντικειμένου μας είναι στο <InlineMath math="[\frac{1}{2}, \frac{1}{2},\frac{1}{2}]"/>. Για να το πάμε στο κέντρο θα κάνουμε μια μεταφορά κατα διάνυσμα <InlineMath math="\vec{d}=[-\frac{1}{2},-\frac{1}{2},-\frac{1}{2}]"/>
        </p>
        <p>
            <InlineMath math="T(\vec{d})="/>
            <MatrixMath matrix={[
                [1,0,0,"-\\frac{1}{2}"],
                [0,1,0,"-\\frac{1}{2}"],
                [0,0,1,"-\\frac{1}{2}"],
                [1,1,1,1]
            ]}/>
        </p>
        <p>Τώρα που είμαστε στο κέντρο μπορούμε να ξεκινήσουμε να κάνουμε την αλλαγή κλίμακας. Η άσκηση ζητάει διάσταση πλευράς ίση με 2 μονάδες. Αυτη την στιγμή είναι 1 μονάδα. Οπότε θα το διπλασιάσουμε (σε όλους τους άξονες)</p>
        <p>
            <InlineMath math="S(2,2,2)="/>
            <MatrixMath matrix={[
                [2,0,0,0],
                [0,2,0,0],
                [0,0,2,0],
                [1,1,1,1]
            ]}/>
        </p>
        <p>Έπειτα θέλουμε μια περιστροφή γύρω απο τον άξονα Z κατα +45 μοίρες</p>
        <p>
            <InlineMath math="R_z(45)="/>
        </p>
    </div>
}