import brick from "../assets/realismos/brick.jpg"
import cube from "../assets/realismos/texturing/cube.png"
import uv from "../assets/realismos/texturing/uv.png"

export default function Yfh()
{
    return <div  className="flex flex-col gap-3">
        <h1>Υφή</h1>
        <p>Έστω οτι φτιάχνουμε έναν τοίχο απο τούβλα. Το 3D μοντέλου ενός τοίχου είναι απλό. Είναι απλά ένας κύβος που έχουμε αλλάξει τις διαστάσεις του.
            Το δύσκολο κομμάτι είναι να το κάνουμε να φένεται σαν να υπάρχουν τούβλα. Φυσικά θα μπορούσαμε να φτιάξουμε 3D μοντέλα απο τουβλά και να φτιάξουμε έναν τοίχο.
            Αλλά αυτο δεν θα ήταν αποδοτικό γιατι θα είχαμε παραπανω γεωμετρία, άρα θα χρειαζόμασταν περισσότερη υπολογιστική ισχύη. Αυτο που κάνουμε είναι να "ντύσουμε" τον τοίχο μας
            με μια εικόνα απο τούβλα. 
        </p>
        <img src={brick} width={400} height={400} alt="Brick Wall Image" />
        <h2>UV mapping</h2>
        <p>Έστω οτι έχουμε φτιάξει έναν κύβο</p>
        <img src={cube} width={400} height={400} alt="Brick Wall Image" />
        <p>Τα textures μας που θα βάλουμε είναι 2D εικόνες (συνήθως). Οπότε πρέπει να ορίσουμε μια αντιστοιχεία της 3D γεωμετρίας πάνω στην 2D εικόνα. Αυτη η διαδικασία ονομάζεται UV mapping.
            Παρακάτω έχω βάλει σε ποιο σημείο της 2D εικόνας θα αντιστοιχεί κάθε πολύγωνο (face) του κύβου μου.
        </p>
        <img src={uv} width={400} height={400} alt="Brick Wall Image" />
        <p>Η ονομάσια UV προέρχεται απο την ονομασία των δύο αξόνων οπου ο οριζόντιος είναι ο U και ο κάθετος ο V</p>
    </div>
}