import zBuffer from '../assets/eisagogi/z-buffer.png';

export default function Apokripsi()
{
    return <div className="flex flex-col gap-3">
        <h1>Απόκρυψη</h1>
        <p>Τεχνική κατά την οποία δεν ζωγραφίζουμε πολύγωνα που αποκρύπτονται απο άλλα πολύγωνα. Αν έχουμε 10 κύβους πίσω απο έναν τοίχο
            δεν χρειάζεται να ζωγραφίσουμε τους κύβους.
        </p>
        <h2>Αλγόριθμος Z Buffer</h2>
        <p>Έχουμε έναν καταχωρήτη (buffer/2D array) οπού έχει το ίδιο μέγεθος με τον καταχωρητή εικόνας (image buffer). Και αποθηκεύουμε
            τα ελάχιστα βάθη για κάθε pixel. Προφανώς καθώς αλλάζουμε τις τιμές του Z buffer αλλάζουμε και τις τιμές του image buffer
            για να ζωγραφίσουμε το χρώμα των pixels που βρίσκονται πιο κόντα μας και "καλύπτουν" άλλα pixels. Ένα αρνητικό του Z buffer
            είναι οι διάφανες επιφάνεις που μπορούμε να δούμε αντικείμενα μέσα απο άλλα αντικείμενα.
        </p>
        <p>Στην παρακάτω είκονα είναι μια απεικόνιση του Z buffer. Τα pixels είναι χρωματισμένα με βάση το βάθος τους.
            Όσο πιο άσπρα τόσο πιο κοντά. Όσο πιο μαυρά τόσο πιο μακριά.
        </p>
        <img src={zBuffer} width={400} height={400} alt="Z Buffer" className="mt-3 border-2"/>
    </div>
}